; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph3 - mode
	infrared1 - mode
	spectrograph2 - mode
	thermograph4 - mode
	infrared0 - mode
	GroundStation8 - direction
	Star6 - direction
	Star1 - direction
	GroundStation5 - direction
	Star7 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation4 - direction
	Star3 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph4)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star7)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 spectrograph3)
	(supports instrument7 spectrograph2)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite2 Star0)
	(have_image Phenomenon9 spectrograph2)
	(have_image Planet10 spectrograph2)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 spectrograph3)
	(have_image Phenomenon13 spectrograph3)
	(have_image Planet14 infrared1)
	(have_image Planet15 infrared0)
))

)

; plan
1. (turn_to satellite2 groundstation2 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 8
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 8
3. (calibrate satellite2 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 8
4. (turn_to satellite2 planet15 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet15)
   goals met: 0 of 8
5. (take_image satellite2 planet15 instrument6 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 1 of 8
6. (turn_to satellite2 phenomenon13 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 8
7. (take_image satellite2 phenomenon13 instrument6 spectrograph3)
   added: (have_image phenomenon13 spectrograph3)
   goals met: 2 of 8
8. (turn_to satellite2 phenomenon11 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 8
9. (turn_to satellite1 groundstation4 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 groundstation4)
   goals met: 2 of 8
10. (take_image satellite2 phenomenon11 instrument6 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 3 of 8
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 8
12. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 3 of 8
13. (turn_to satellite1 phenomenon9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 8
14. (take_image satellite1 phenomenon9 instrument3 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 4 of 8
15. (turn_to satellite1 planet10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet10)
   goals met: 4 of 8
16. (take_image satellite1 planet10 instrument3 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 5 of 8
17. (turn_to satellite1 planet14 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet14)
   goals met: 5 of 8
18. (take_image satellite1 planet14 instrument3 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 6 of 8
19. (turn_to satellite2 star12 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star12)
   goals met: 6 of 8
20. (take_image satellite2 star12 instrument6 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 7 of 8
21. (turn_to satellite2 star0 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star0)
   goals met: 8 of 8
